1:NPCFormats
00000011
Moonstrider Scout
月影侦察兵
Boss
Boss
首领
Elite
Elite
精英
First_Last
Ex:  "Bob Jones"
#1:$NPC_FIRSTNAME$ #2:$NPC_LASTNAME$
First_Last_Title
Ex: "Tyrone Rugen The Imp"
#1:$NPC_FIRSTNAME$ #2:$NPC_LASTNAME$ #3:$NPC_TITLE$
First_Nick
A guy who has just a first name and a nickname
#1:$NPC_FIRSTNAME$ "#2:$NPC_NICKNAME$"
First_Nick_Last
Three part name
#1:$NPC_FIRSTNAME$ "#2:$NPC_NICKNAME$" #3:$NPC_LASTNAME$
First_Nick_Last_Title
Format for a full verbose name
#1:$NPC_FIRSTNAME$ "#2:$NPC_NICKNAME$" #3:$NPC_LASTNAME$ #4:$NPC_TITLE$
First_Nick_Title
Format for a guy with no last name
#1:$NPC_FIRSTNAME$ "#2:$NPC_NICKNAME$" #3:$NPC_TITLE$
First_Only
Ex:  "Hodor"
#1:$NPC_FIRSTNAME$
First_Title
Ex:  "Bob The Jug-head"
#1:$NPC_FIRSTNAME$ #2:$NPC_TITLE$
Goal_First_Last
Ex:  "Bob Jones"
#1:$GOAL_FIRSTNAME$ #2:$GOAL_LASTNAME$
Goal_First_Last_Title
Ex: "Tyrone Rugen The Imp"
#1:$GOAL_FIRSTNAME$ #2:$GOAL_LASTNAME$ #3:$GOAL_TITLE$
Goal_First_Nick
A guy who has just a first name and a nickname
#1:$GOAL_FIRSTNAME$ "#2:$GOAL_NICKNAME$"
Goal_First_Nick_Last
Three part name
#1:$GOAL_FIRSTNAME$ "#2:$GOAL_NICKNAME$" #3:$GOAL_LASTNAME$
Goal_First_Nick_Last_Title
Format for a full verbose name
#1:$GOAL_FIRSTNAME$ "#2:$GOAL_NICKNAME$" #3:$GOAL_LASTNAME$ #4:$GOAL_TITLE$
Goal_First_Nick_Title
Format for a guy with no last name
#1:$GOAL_FIRSTNAME$ "#2:$GOAL_NICKNAME$" #3:$GOAL_TITLE$
Goal_First_Only
Ex:  "Hodor"
#1:$GOAL_FIRSTNAME$
Goal_First_Title
Ex:  "Bob The Jug-head"
#1:$GOAL_FIRSTNAME$ #2:$GOAL_TITLE$
Goal_Title_First
Ex:  "Jug-head Bob"
#1:$GOAL_TITLE$ #2:$GOAL_FIRSTNAME$
Goal_Title_First_Last
Ex: "Lord Tyrone Rugen"
#1:$GOAL_TITLE$ #2:$GOAL_FIRSTNAME$ #3:$GOAL_LASTNAME$
Goal_Title_First_Nick
Format for a guy with no last name
#1:$GOAL_TITLE$ #2:$GOAL_FIRSTNAME$ "#3:$GOAL_NICKNAME$"
Goal_Title_First_Nick_Last
Format for a full verbose name
#1:$GOAL_TITLE$ #2:$GOAL_FIRSTNAME$ "#3:$GOAL_NICKNAME$" #4:$GOAL_LASTNAME$
Name
Just Name
#1:$NPC_NAME$
Name_Level
#1:$NPC_NAME$\n<Rank #2:$NPC_LEVEL$>
#1:$NPC_NAME$\n<等级 #2:$NPC_LEVEL$>
Name_LevelBoss
#1:$NPC_NAME$\n<Rank #2:$NPC_LEVEL$ #3:$NPC_BOSS$>
#1:$NPC_NAME$\n<等级 #2:$NPC_LEVEL$ #3:$NPC_BOSS$>
Name_Title
#1:$NPC_NAME$\n<#2:$NPC_TITLE$>
#1:$NPC_NAME$ #2:$NPC_TITLE$
Rank
Rank
等级
Title_First
Ex:  "Jug-head Bob"
#1:$NPC_TITLE$ #2:$NPC_FIRSTNAME$
Title_First_Last
Ex: "Lord Tyrone Rugen"
#1:$NPC_TITLE$ #2:$NPC_FIRSTNAME$ #3:$NPC_LASTNAME$
Title_First_Nick
Format for a guy with no last name
#1:$NPC_TITLE$ #2:$NPC_FIRSTNAME$ "#3:$NPC_NICKNAME$"
Title_First_Nick_Last
Format for a full verbose name
#1:$NPC_TITLE$ #2:$NPC_FIRSTNAME$ "#3:$NPC_NICKNAME$" #4:$NPC_LASTNAME$
